10/data/attachments/7a15a20f046e2869.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cd72e90a-4f6b-4d2f-8072-71fdbca03d0f</nif:username>
            <nif:friendToBeAdded>James_network_Friend_93719_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>